<?php
/**
 * main.php.
 * User: Hodge.Yuan@hotmail.com
 * Date: 2019/6/5 0005
 * Time: 14:04
 */
require_once "vendors/Yutu/MakePHPGreatAgain.php";

/**
 * ___  ___        _           ______  _   _ ______   _____                     _      ___                 _
 * |  \/  |       | |          | ___ \| | | || ___ \ |  __ \                   | |    / _ \               (_)
 * | .  . |  __ _ | | __  ___  | |_/ /| |_| || |_/ / | |  \/ _ __   ___   __ _ | |_  / /_\ \  __ _   __ _  _  _ __
 * | |\/| | / _` || |/ / / _ \ |  __/ |  _  ||  __/  | | __ | '__| / _ \ / _` || __| |  _  | / _` | / _` || || '_ \
 * | |  | || (_| ||   < |  __/ | |    | | | || |     | |_\ \| |   |  __/| (_| || |_  | | | || (_| || (_| || || | | |
 * \_|  |_/ \__,_||_|\_\ \___| \_|    \_| |_/\_|      \____/|_|    \___| \__,_| \__| \_| |_/ \__, | \__,_||_||_| |_|
 *
 */
new Yutu\MakePHPGreatAgain(__DIR__, [
    // 入口目录名
    'name' => 'app',
    // 控制器目录名
    'controller' => 'controller',

    // 是否启用redis
    'redis' => false,
    // 是否启用自定义路由映射
    'route' => true,

]);